tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Emacs dependency management
brew "cask"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Windows manager and desktop organizer
cask "hazeover"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
